{
    "total_findings": 9374,
    "total_failed_findings": 3500,
    "pillar_counts": {
        "security": 1904,
        "reliability": 536,
        "costOptimization": 458,
        "sustainability": 338,
        "operationalExcellence": 194,
        "performance": 70
    },
    "severity_counts": {
        "Low": 1394,
        "Medium": 1356,
        "High": 708,
        "Critical": 42
    },
    "check_title_counts": {
        "Medium": {
            "CloudWatch Logs Retention Configuration": 312,
            "S3 bucket should have server access logging enabled.": 196,
            "Restrict security groups with all outbound traffic open to the public": 110,
            "S3 bucket should allow only HTTPS requests.": 94,
            "S3 Bucket Policy not Configured.": 72,
            "Enable EC2 Instances backup": 44,
            "Enable EBS backup": 42,
            "EBS volumes must be encrypted.": 34,
            "EC2 IMDSv2 enabled": 30,
            "Ensure Public IP Address Assignment for subnets is disabled": 24,
            "Restrict external principal access in Resource Access Manager": 22,
            "Unused IAM Credentials Should Be Removed": 20,
            "Rotate Old Secrets": 18,
            "Ensure IAM Users Receive Permissions Only Through Groups": 18,
            "Enable Flow Logs for VPC Subnets": 18,
            "IAM Users Should Have Multi-Factor Authentication (MFA) Enabled": 16,
            "EBS snapshots must be encrypted.": 14,
            "SNS topics should have active subscriptions": 14,
            "Enable CloudWatch logging for CodeBuild": 12,
            "Protect Elastic IPs with Shield Advanced": 12,
            "Ensure the Instance profile is attached to EC2 Instances": 12,
            "Use Amazon Data Lifecycle Manager": 12,
            "EC2 Instances must not be associated with Elastic or Public IP Address.": 10,
            "Protect ELBv2s with AWS Shield Advanced": 10,
            "Ensure TLS 1.2 enforcement for all secure listeners": 10,
            "Enable ELBv2 Elastic Load Balancing Deletion Protection": 10,
            "Enable ELBv2 invalid HTTP header drop": 10,
            "Ensure a log metric filter and alarm exist for IAM policy changes": 8,
            "Enable Key Rotation for KMS customer master key": 8,
            "Encrypt CloudTrail logs at rest using SSE-KMS.": 8,
            "Configure a NAT Gateway": 8,
            "Ensure a log metric filter and alarm exist for disabling or scheduled deletion of customer managed keys": 8,
            "Ensure There Is Only One Active Access Key Available for Any Single IAM User": 6,
            "Use IAM Managed Policies": 6,
            "Encrypt s3 logging for CodeBuild": 4,
            "Optimizing API Performance with Amazon API Gateway Stage Caching": 4,
            "Enable Custom access logging on API Gateway Stages": 4,
            "Use Global Accelarator": 4,
            "Avoid using default VPCs": 4,
            "Ensure Kerberos and Active Directory is implemented for Enhanced RDS Security": 4,
            "Enable CloudTrail for Organization-wide Logging": 4,
            "Multiple  multi-regional trails found": 4,
            "Implement Glue Data Catalog Resource Policy": 4,
            "Amazon Macie is in use.": 4,
            "Use IAM Authentication for RDS DBs": 4,
            "Password Policies for IAM Users Should Have Strong Configurations": 4,
            "Ensure IAM password policy is set to expire passwords within 90 days or less": 4,
            "Ensure Deactivation of Auto-Scaling for DynamoDB Tables": 4,
            "Enable default encryption for new EBS volumes.": 4,
            "Use Resiliency Hub": 4,
            "Enable API Gateway Caching": 4,
            "Back up DynamoDB tables": 4,
            "Ensure IAM Password Policy Requires Minimum Length of 14 or Greater": 4,
            "Protect Route 53 hosted zones with AWS Shield Advanced": 4,
            "Use EBS Optimized EC2 instances": 2,
            "Restrict access to WSDCOM-RPC port (tcp135)": 2,
            "Restrict DMS Replication Instance Public Access": 2,
            "Restrict access to SMB port (tcp445)": 2,
            "CloudFront Viewer Protocol Policy.": 2,
            "Protect CloudFront Distributions protected with AWS Shield Advanced": 2,
            "Security Hub is enabled": 2,
            "Amazon S3 Protection in Amazon GuardDuty.": 2,
            "CloudFront Integrated With WAF": 2,
            "Enable ECR repository scan-on-push": 2,
            "Multiple  CloudTrail trails found": 2,
            "CloudFront Priceclass_all Configuration Check": 2,
            "Ensure CloudFront is in use and its distribution status is enabled": 2,
            "Restrict access to MSSQL port (tcp1433)": 2
        },
        "Low": {
            "Unused Amazon Machine Images (AMIs) must be removed.": 248,
            "Check for EBS Old Snapshots older than 30 days.": 140,
            "S3 object versioning provides an extra layer of data protection and/ or data retention, versioning enables you to recover and preserve deleted objects from S3 bucket. This check verifies if versioning is enabled for your S3 buckets.": 132,
            "Detect and Manage Configuration Drift in CloudFormation Stacks": 106,
            "Ensure MFA Delete is Enabled on S3 Buckets": 98,
            "Enable S3 bucket lifecycle policies": 82,
            "Secure Lambda Execution with Virtual Private Cloud (VPC) for Isolation": 80,
            "Invocation Error Monitoring for Functions": 58,
            "Outdated EC2 AMIs": 56,
            "Timeout Error Monitoring for Functions.": 50,
            "Ensure Provisioned IOPS volumes have been attached to instances for optimal performance efficiency": 46,
            "Delete Unused Lambda Functions": 42,
            "Instance in autoscaling group": 36,
            "Successful SSM association": 20,
            "Use Linux-Powered EC2 Instances": 20,
            "Ensure a log metric filter and alarm exist for changes to Network Access Control Lists (NACL)": 8,
            "Ensure a log metric filter and alarm exist for S3 bucket policy changes": 8,
            "Route53 resolver Query Logging.": 8,
            "Ensure a log metric filter and alarm exist for security group changes": 8,
            "Default security groups should not have any in-bound or outbound rule present": 8,
            "Ensure a log metric filter and alarm exist for CloudTrail configuration changes": 8,
            "Enable CloudWatch logs to record API logs of API Gateway Stages": 8,
            "Ensure a log metric filter and alarm exist for unauthorized API calls": 8,
            "Ensure a log metric filter and alarm exist for usage of root user": 8,
            "Unassociated Elastic IP Addresses.": 8,
            "Ensure a log metric filter and alarm exist for AWS Config configuration changes": 8,
            "Ensure a log metric filter and alarm exist for AWS Management Console authentication failures": 8,
            "Ensure a log metric filter and alarm exist for route table changes": 8,
            "Ensure a log metric filter and alarm exist for Management Console sign-in without MFA.": 8,
            "Ensure a log metric filter and alarm exist for VPC changes.": 8,
            "Check for unassociated Network Interfaces": 4,
            "Enable Amazon Detective": 4,
            "Enable API Gateway Stage Metrics": 4,
            "Enable CloudWatch logging for RDS databases ": 4,
            "Enable Deletion Protection for RDS Instances": 4,
            "Enable TTL for DynamoDB tables": 4,
            "Implement RDS read replica": 4,
            "Log CloudTrail Management Events for Improved Visibility and Auditability": 4,
            "Enable RDS Event Notification.": 4,
            "Enable AWS Signer": 4,
            "Implement RDS Instance Multi-AZ": 4,
            "Ensure the AWS ACM has no unused certificates": 2,
            "AWS CloudFront distribution with access logging is enabled": 2,
            "Define Lifecycle policy for Amazon ECR image repository": 2,
            "AWS CloudFront web distribution with geo restriction is enabled": 2,
            "Enable CIS AWS Foundations Benchmark in Security Hub": 2,
            "Enable AWS foundational Security Best Practices compliance standard in Security Hub.": 2,
            "Configure DMS for Multi-AZ deployment": 2,
            "Ensure CloudTrail trails are integrated with Amazon CloudWatch Logs": 2
        },
        "High": {
            "Ensure AWS IAM Policies Allow Only the Required Privileges for Each Role": 166,
            "SNS Topic Server Side Encryption (SSE).": 74,
            "Security Groups accept global traffic only from ports 80 and 443": 64,
            "Enforce Customer-Managed Key Encryption for Lambda Environment Variables": 52,
            "Restrict access to remote server ports (tcp3389 and tcp22)": 44,
            "Restrict access to RDP port (tcp3389)": 24,
            "Enable Access logs when using ELBv2.": 20,
            "Enable Glue Crawler security configuration to encrypt CloudWatch logs": 20,
            "Use CloudWatch Dashboards": 20,
            "Use AWS Managed kubernetes Service (EKS)": 16,
            "Ensure elastic load balancers are using secure listeners.": 16,
            "Use AWS Managed Container Service (ECS)": 16,
            "Encrypt Amazon Machine Images (AMIs)": 14,
            "Identify security groups which allow all traffic from the internet, the best practice is to exercise principle of least privilege": 14,
            "Ensure Amazon Lambda Functions Do Not Share the Same AWS IAM Execution Role": 14,
            "Ensure Credentials (with First Activated AccessKey) Unused for 90 Days or Greater Are Disabled": 14,
            "Check for public SNS Topics": 12,
            "Enable Amazon CloudWatch Internet Monitor": 8,
            "AWS CloudTrail must be enabled with multi-region option": 8,
            "Ensure a log metric filter and alarm exist for changes to network gateways": 8,
            "Enable Audit Manager": 8,
            "Use AWS Managed Database Services (DB)": 8,
            "Ensure Credentials (with Second Activated AccessKey) Unused for 90 Days or Greater Are Disabled": 6,
            "Enable Amazon RDS Enhanced Monitoring": 6,
            "Protect API Gateway stages with WAF WACL": 4,
            "Enable Amazon Inspector for AWS Lambda function scanning": 4,
            "Use AWS Managed Fargate": 4,
            "Ensure a Support Role Has Been Created to Manage Incidents with AWS Support": 4,
            "Enable Amazon Inspector": 4,
            "Enable Amazon Inspector for ECR scanning": 4,
            "Static website hosting is disabled on S3 buckets": 4,
            "AWS RDS databases are encrypted using KMS Customer Managed Keys.": 4,
            "Enable Amazon Inspector for EC2 scanning": 4,
            "Enable DynamoDB table point-in-time recovery.": 4,
            "Enable API Key required check on a Method Requests": 4,
            "CloudTrail Bucket MFA Delete Enabled": 2,
            "Configure Glue Data Catalog password encryption": 2,
            "Restrict Lambda Functions to avoid Admin Privileges for Security": 2,
            "Ensure that the API Endpoint type in API Gateway is set to Private and is not exposed to the public internet": 2,
            "Glue Data Catalog Encryption At Rest": 2,
            "Enable S3 bucket access logging on the CloudTrail S3 bucket.": 2
        },
        "Critical": {
            "Secrets Manager Secrets Should Have Automatic Rotation Enabled": 26,
            "CloudTrail Public Buckets": 4,
            "Ensure Amazon S3 Buckets are Privately Configured with Block Public Access": 4,
            "Identify and Secure S3 Buckets ACLs with FULL_CONTROL, READ, or READ_ACP Permissions to Public or ALL USERS": 2,
            "S3 Bucket Policy Should Not Allow Get Actions from All Principals": 2,
            "Address Security Hub High Critical Findings": 2,
            "S3 Bucket Should Not Allow Get Actions from All Principals Without a Condition": 2
        }
    }
}